//215 праактика
//1 Сделайте функцию, которая параметром будет принимать массив и возвращать сумму его элементов.
// function func(arr) {
//   let sum= 0;
//   for(let i=0; i < arr.length; i++){
//     sum += arr[i];
//   }
//   return sum;
// }
// let arr=[1, 2, 3];
// console.log(func(arr))
// =======================================================================
// 2 Сделайте функцию, которая параметром будет принимать число и возвращать массив его делителей.
// function func(num){
//   let arr = [];
//   for( let i =0; i <=num; i++){
//     if(num % i ==0 ){
//       arr.push(i)
//     }
//   }
//   return arr;
// }
// console.log(func(10))
// =========================================================================
// 3 Сделайте функцию, которая параметром будет принимать строку и возвращать массив ее символов.
// function func(str){
//  let arr=[];
//   for(let i = 0; i < str.length; i++){
//     arr[i]=str[i];
//   }
//   return arr
// }
// console.log(func("12e3rrwe"))
// =====================================================================
// 4 Сделайте функцию, которая параметром будет принимать строку и переворачивать ее символы в обратном порядке.
// function func(str){
//   let stroka="";
//   for(let i = str.length-1; i >= 0; i--){
//     stroka += str[i];
//   }
//   return stroka
// }
// console.log(func("abcd"))
// ========================================================================
// 5 Сделайте функцию, которая параметром будет принимать строку и делать заглавной первую букву этой строки.
// function func(str){
//   let res= str.slice(0 , 1).toUpperCase() + str.slice(1);
//   return res
// }
// console.log(func("regbk"))
// =========================================================================
// 6 Сделайте функцию, которая параметром будет принимать строку и делать заглавной первую букву каждого слова этой строки.
// function func(str){
//   let stroka="";
//   let arr = str.split(' ');
//   for(let i =0; i < arr.length; i++){
//     stroka += arr[i][0].toUpperCase() + arr[i].slice(1) + ' ';
//   }
//   return stroka;
// }
// console.log(func("ghgh dier"))
// =======================================================================
// 7 Сделайте функцию, заполняющую массив целыми числами от 1 до заданного.
// function func(num){
//   let arr=[];
//   for(let i = 1; i <= num; i++){
//     arr.push(i);
//   }
//   return arr
// }
// console.log(func(4))
// ========================================================================
// 8 Сделайте функцию, которая параметром будет принимать число и возвращать сумму его цифр.
// function func(num){
//   num=String(num);
//   let sum = 0;
//   for(let i=0; i < num.length; i++){
//     sum += Number(num[i]);
//   }
//   return sum
// }
// console.log(func(1234))
// =========================================================================
// 9 Сделайте функцию, которая параметром будет год и проверять, високосный он или нет.
// function func(year){
//   if ((year%4 == 0 && year%100 != 0) || (year%400 == 0)){
//     return 'високосный' 
//   }
//   else {
//     return 'не високосный'
//   }
// }
// console.log(func(2000))
// ========================================================================
// 10 Сделайте функцию, которая параметром будет принимать секунды, а возвращать количество суток, соответствующих этим секундам.
// function func(sec){
//   return Math.floor(sec / (24*60*60))
// }
// console.log(func(200000))
//======================================================================================
// 11 Сделайте функцию, которая будет возвращать случайный элемент из массива.
// function func(arr){
//   return arr[Math.floor(Math.random() * ((arr.length-1) + 1))] 
// }
// console.log(func([1]))
//==============================================================================
// 12 Сделайте функцию, которая параметром будет принимать число и проверять, простое оно или нет.
// function func(num){
//   let count=0;
//   for( let i =0; i <=num; i++){
//     if(num % i ==0 ){
//       count++;
//     }
//   }
//   if(count==2){
//     return 'простое'
//   }
//   else{
//     return 'не простое'
//   }
// }
// console.log(func(7))


